---
kind: method
id: M:Autodesk.Revit.UI.IDropHandler.Execute(Autodesk.Revit.UI.UIDocument,System.Object)
source: html/a2f59c67-81ed-c53e-ed43-d8d56a13e0f1.htm
---
# Autodesk.Revit.UI.IDropHandler.Execute Method

Implement this method to handle the drop event for your data.

## Syntax (C#)
```csharp
void Execute(
	UIDocument document,
	Object data
)
```

## Parameters
- **document** (`Autodesk.Revit.UI.UIDocument`) - The document on which the data was dropped.
- **data** (`System.Object`) - The data.